In [1]:
import pandas as pd
import numpy as np

In [2]:
# Contoh dataframe
df = pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.164434  1.831494 -0.243704 -0.036644
B  0.264093  0.254355 -0.912466 -1.025696
C  1.084147 -1.107435  0.589940 -1.221104
D -0.336316  2.191760 -0.184939 -0.836374
E -1.135801 -0.104931  1.401121 -0.608864

In [3]:
# Menampilkan data kolom W
df['W']

A    2.164434
B    0.264093
C    1.084147
D   -0.336316
E   -1.135801
Name: W, dtype: float64

In [5]:
df.W # tidak direkomendasikan

A    2.164434
B    0.264093
C    1.084147
D   -0.336316
E   -1.135801
Name: W, dtype: float64

In [6]:
df[['W','X','Z']]

          W         X         Z
A  2.164434  1.831494 -0.036644
B  0.264093  0.254355 -1.025696
C  1.084147 -1.107435 -1.221104
D -0.336316  2.191760 -0.836374
E -1.135801 -0.104931 -0.608864

In [7]:
# Menambah kolom baru
df['baru'] = df['W'] + df['Y']
df

          W         X         Y         Z      baru
A  2.164434  1.831494 -0.243704 -0.036644  1.920730
B  0.264093  0.254355 -0.912466 -1.025696 -0.648374
C  1.084147 -1.107435  0.589940 -1.221104  1.674086
D -0.336316  2.191760 -0.184939 -0.836374 -0.521256
E -1.135801 -0.104931  1.401121 -0.608864  0.265320

In [8]:
# Menghapus kolom berarti axis=1, kalo axis=0 berarti menghapus baris atau index
df.drop('baru',axis=1)

          W         X         Y         Z
A  2.164434  1.831494 -0.243704 -0.036644
B  0.264093  0.254355 -0.912466 -1.025696
C  1.084147 -1.107435  0.589940 -1.221104
D -0.336316  2.191760 -0.184939 -0.836374
E -1.135801 -0.104931  1.401121 -0.608864

In [9]:
# Ketika dipanggil lagi ternyata hasil perubahan tidak berubah
df

          W         X         Y         Z      baru
A  2.164434  1.831494 -0.243704 -0.036644  1.920730
B  0.264093  0.254355 -0.912466 -1.025696 -0.648374
C  1.084147 -1.107435  0.589940 -1.221104  1.674086
D -0.336316  2.191760 -0.184939 -0.836374 -0.521256
E -1.135801 -0.104931  1.401121 -0.608864  0.265320

In [10]:
# Agar perubahan disimpan langsung
df.drop('baru',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.164434  1.831494 -0.243704 -0.036644
B  0.264093  0.254355 -0.912466 -1.025696
C  1.084147 -1.107435  0.589940 -1.221104
D -0.336316  2.191760 -0.184939 -0.836374
E -1.135801 -0.104931  1.401121 -0.608864

In [11]:
# Menghapus baris
df.drop('E',axis=0)

          W         X         Y         Z
A  2.164434  1.831494 -0.243704 -0.036644
B  0.264093  0.254355 -0.912466 -1.025696
C  1.084147 -1.107435  0.589940 -1.221104
D -0.336316  2.191760 -0.184939 -0.836374

In [12]:
# Untuk menampilkan baris saja
df.loc['A']

W    2.164434
X    1.831494
Y   -0.243704
Z   -0.036644
Name: A, dtype: float64

In [13]:
df.iloc[2] # Untuk menampilkan baris dengan index defoault

W    1.084147
X   -1.107435
Y    0.589940
Z   -1.221104
Name: C, dtype: float64

In [14]:
df.loc['C','Z']

-1.2211043465811502

In [15]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.164434 -0.243704
B  0.264093 -0.912466

In [16]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B   True   True  False  False
C   True  False   True  False
D  False   True  False  False
E  False  False   True  False

In [17]:
df[df > 0]

          W         X         Y   Z
A  2.164434  1.831494       NaN NaN
B  0.264093  0.254355       NaN NaN
C  1.084147       NaN  0.589940 NaN
D       NaN  2.191760       NaN NaN
E       NaN       NaN  1.401121 NaN

In [18]:
df[df['W']>0]

          W         X         Y         Z
A  2.164434  1.831494 -0.243704 -0.036644
B  0.264093  0.254355 -0.912466 -1.025696
C  1.084147 -1.107435  0.589940 -1.221104

In [19]:
df[df['W']>0]['Y']

A   -0.243704
B   -0.912466
C    0.589940
Name: Y, dtype: float64

In [20]:
df[df['W']>0][['Y','Z']]

          Y         Z
A -0.243704 -0.036644
B -0.912466 -1.025696
C  0.589940 -1.221104

In [21]:
df[(df['W']>0) & (df['X']>1)]

          W         X         Y         Z
A  2.164434  1.831494 -0.243704 -0.036644

In [22]:
df[(df['W']>0) | (df['X']>1)]

          W         X         Y         Z
A  2.164434  1.831494 -0.243704 -0.036644
B  0.264093  0.254355 -0.912466 -1.025696
C  1.084147 -1.107435  0.589940 -1.221104
D -0.336316  2.191760 -0.184939 -0.836374

Data Frame Multi Index

In [23]:
df

          W         X         Y         Z
A  2.164434  1.831494 -0.243704 -0.036644
B  0.264093  0.254355 -0.912466 -1.025696
C  1.084147 -1.107435  0.589940 -1.221104
D -0.336316  2.191760 -0.184939 -0.836374
E -1.135801 -0.104931  1.401121 -0.608864

In [24]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.164434  1.831494 -0.243704 -0.036644
1     B  0.264093  0.254355 -0.912466 -1.025696
2     C  1.084147 -1.107435  0.589940 -1.221104
3     D -0.336316  2.191760 -0.184939 -0.836374
4     E -1.135801 -0.104931  1.401121 -0.608864

In [25]:
df['kode'] = "INA IND JPN RSA USA".split()
df

          W         X         Y         Z kode
A  2.164434  1.831494 -0.243704 -0.036644  INA
B  0.264093  0.254355 -0.912466 -1.025696  IND
C  1.084147 -1.107435  0.589940 -1.221104  JPN
D -0.336316  2.191760 -0.184939 -0.836374  RSA
E -1.135801 -0.104931  1.401121 -0.608864  USA

In [26]:
df.set_index('kode')

             W         X         Y         Z
kode
INA   2.164434  1.831494 -0.243704 -0.036644
IND   0.264093  0.254355 -0.912466 -1.025696
JPN   1.084147 -1.107435  0.589940 -1.221104
RSA  -0.336316  2.191760 -0.184939 -0.836374
USA  -1.135801 -0.104931  1.401121 -0.608864

In [27]:
df

          W         X         Y         Z kode
A  2.164434  1.831494 -0.243704 -0.036644  INA
B  0.264093  0.254355 -0.912466 -1.025696  IND
C  1.084147 -1.107435  0.589940 -1.221104  JPN
D -0.336316  2.191760 -0.184939 -0.836374  RSA
E -1.135801 -0.104931  1.401121 -0.608864  USA

In [28]:
df.set_index('kode', inplace=True)
df

             W         X         Y         Z
kode
INA   2.164434  1.831494 -0.243704 -0.036644
IND   0.264093  0.254355 -0.912466 -1.025696
JPN   1.084147 -1.107435  0.589940 -1.221104
RSA  -0.336316  2.191760 -0.184939 -0.836374
USA  -1.135801 -0.104931  1.401121 -0.608864

In [29]:
dataLabels = ['G1','G1','G1','G2','G2','G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue))

data = pd.MultiIndex.from_tuples(data)

In [30]:
zip(dataLabels,dataValue)

In [31]:
list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [32]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [33]:
df = pd.DataFrame(np.random.randn(6,2),index=data,columns=['A','B'])
df

             A         B
G1 1 -0.123604 -1.748843
   2  0.180826  1.162239
   3 -0.006913  1.264886
G2 1  0.020666  1.402921
   2 -0.611597  1.313899
   3  0.204200 -0.518272

In [34]:
df.loc['G1']

          A         B
1 -0.123604 -1.748843
2  0.180826  1.162239
3 -0.006913  1.264886

In [35]:
df.loc['G1'].loc[3]

A   -0.006913
B    1.264886
Name: 3, dtype: float64

In [36]:
df.index.names

FrozenList([None, None])

In [37]:
df.index.names = ['Group','No']
df

                 A         B
Group No
G1    1  -0.123604 -1.748843
      2   0.180826  1.162239
      3  -0.006913  1.264886
G2    1   0.020666  1.402921
      2  -0.611597  1.313899
      3   0.204200 -0.518272

In [38]:
df.xs('G1')

           A         B
No
1  -0.123604 -1.748843
2   0.180826  1.162239
3  -0.006913  1.264886

In [40]:
df.xs(['G2',2])

A   -0.611597
B    1.313899
Name: (G2, 2), dtype: float64

In [41]:
df.xs(1,level='No')

              A         B
Group
G1    -0.123604 -1.748843
G2     0.020666  1.402921